КР3/src/Documents/КорректировкаРейтинга/КорректировкаРейтинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаРейтинга</name>
  <registerRecords>InformationRegister.РейтингУчастников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Игрок</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейтинг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРейтинга</name>
      <type>
        <types>CatalogRef.ВидыРейтинга</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КР3/src/InformationRegisters/РейтингУчастников/РейтингУчастников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РейтингУчастников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтарыйРейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прирост</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРейтинга</name>
    <type>
      <types>CatalogRef.ВидыРейтинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КР3/src/Documents/КорректировкаРейтинга/ObjectModule.bsl
//@skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РейтингУчастников.Записывать = Истина;
	
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.РейтингУчастников.Добавить();
		Движение.Период = Дата;
		Движение.Участник = ТекСтрокаДанные.Игрок;
		Движение.Рейтинг = ТекСтрокаДанные.Рейтинг;
		Движение.ВидРейтинга = ТекСтрокаДанные.ВидРейтинга;
		Движение.СтарыйРейтинг = 0;// так как ввод начального то будет 0
	КонецЦикла;
	
КонецПроцедуры
